# **Pandas**

Panel Data - Kısaltması

## Pandas Series

Pandas Serileri, verileri indexleri ile birlikte depolar.

In [1]:
import pandas as pd
serie = pd.Series([9,3,5,7])
serie

0    9
1    3
2    5
3    7
dtype: int64

In [2]:
serie.axes

[RangeIndex(start=0, stop=4, step=1)]

In [3]:
serie.dtype

dtype('int64')

In [4]:
serie.ndim

1

In [5]:
serie.size

4

Indexlerini kendimiz belirleyebiliriz.

In [6]:
serie = pd.Series([9,3,5,7], index = ["a","b","c","d"])
serie

a    9
b    3
c    5
d    7
dtype: int64

# DataFrame

Excele benzer yapıda bulunan Pandas veriyapısıdır. Veri setlerinde en çok kullanılan çeşittir.

In [7]:
liste = [11,22,33,44]
df = pd.DataFrame(liste,columns = ["ilk_sutun"])
df

   ilk_sutun
0         11
1         22
2         33
3         44

In [8]:
import numpy as np
list2 = np.arange(1,10).reshape((3,3))
list2

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [9]:
df = pd.DataFrame(list2, columns = ["sutun1","sutun2","sutun3"])
df

   sutun1  sutun2  sutun3
0       1       2       3
1       4       5       6
2       7       8       9

Sütün isimlerini DataFrame'in columns ozelligine istedigimiz sutun isimlerini vererek degistirebiliyoruz.

In [10]:
df.columns = ["s1","s2","s3"]
df

   s1  s2  s3
0   1   2   3
1   4   5   6
2   7   8   9

DataFrame'in en basindan belirli bir eleman gorebilmek icin _head_ fonksiyonu kullanilir.

In [11]:
df.head(1)

   s1  s2  s3
0   1   2   3

DataFrame'in en sonundan belirli bir eleman gorebilmek icin tail fonksiyonu kullanilir.

In [12]:
df.tail(1)

   s1  s2  s3
2   7   8   9

In [13]:
df.ndim

2

In [14]:
df.shape

(3, 3)

In [15]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['s1', 's2', 's3'], dtype='object')]

In [16]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [17]:
type(df.values)

numpy.ndarray

## DataFrame Eleman İşlemleri

Sozluk uzerinden DataFrame olusturma islemi :

In [18]:
var1 = np.random.randint(10, size = 5)
var2 = np.random.randint(10, size = 5)
var3 = np.random.randint(10, size = 5)
sozluk = {"var1" : var1, "var2" : var2, "var3" : var3}
sozluk

{'var1': array([5, 3, 5, 7, 9]),
 'var2': array([1, 7, 0, 1, 4]),
 'var3': array([0, 7, 3, 2, 1])}

In [19]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     5     1     0
1     3     7     7
2     5     0     3
3     7     1     2
4     9     4     1

Slice islemi DataFrame uzerinde de gerceklestirilebiliyor.

In [20]:
df[0:1]

   var1  var2  var3
0     5     1     0

Default olarak ordinal bir sekilde tanimlanmis olan DataFrame'in index ozelligini kendimiz de degistirebiliriz.

In [21]:
df.index = ["a","b","c","d","e"]
df

   var1  var2  var3
a     5     1     0
b     3     7     7
c     5     0     3
d     7     1     2
e     9     4     1

In [22]:
df["a":"c"]

   var1  var2  var3
a     5     1     0
b     3     7     7
c     5     0     3

DataFrame icerisinden _gecici_ bir sekilde eleman silmek icin drop fonksiyonu kullanilir.

In [23]:
df.drop("a", axis = 0)

   var1  var2  var3
b     3     7     7
c     5     0     3
d     7     1     2
e     9     4     1

Eger kalici olarak silme islemini gerceklestirmek istiyorsak _inplace = True_ argumanini drop fonksiyonu icerisine vermemiz gerekmektedir.

In [24]:
df.drop("a", axis = 0 , inplace = True)
df

   var1  var2  var3
b     3     7     7
c     5     0     3
d     7     1     2
e     9     4     1

Eger DataFrame uzerindeki bir column silmek istersek _axis = 1_ parametresini vermemiz gerekmektedir.

In [25]:
df.drop("var1", axis = 1)

   var2  var3
b     7     7
c     0     3
d     1     2
e     4     1

Daha ogrence gordugumuz Fancy Indexing yontemini burada da kullanabiliyoruz.

In [26]:
df.drop(["b","d"],axis = 0)

   var1  var2  var3
c     5     0     3
e     9     4     1

In [27]:
df["var4"] = df["var2"]/df["var3"]

In [28]:
df

   var1  var2  var3  var4
b     3     7     7   1.0
c     5     0     3   0.0
d     7     1     2   0.5
e     9     4     1   4.0

In [29]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     3     7     7
c     5     0     3
d     7     1     2
e     9     4     1

In [30]:
l = ["var1","var2"]
df.drop(l,axis=1)

   var3  var4
b     7   1.0
c     3   0.0
d     2   0.5
e     1   4.0

## Gözlem ve Değişken Seçimi : loc & iloc

In [31]:
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2","var3"])
df

   var1  var2  var3
0     8    11    14
1    11    13    15
2    18    25     8
3    11     1    11
4     6     5    29
5    29     9     4
6     2     9     6
7    27    11     3
8    10    17    10
9    23    28    16

**loc :** Tanımlandığı şekli ile seçim yapmak için kullanılır. Yapılan indexlemeye sadık kalır. Verilen indexlerin son elemanını da döndürür. Ayrica sayisal bir indexi olmayan satir ve sutunlara ulasmak icin kullanilir.

In [32]:
df.loc[0:3]

   var1  var2  var3
0     8    11    14
1    11    13    15
2    18    25     8
3    11     1    11

**iloc :** Alışık olduğumuz indexleme mantığıyla çalışır. Sadece sayisal indexleme icin kullanilir.

In [33]:
df.iloc[0:3]

   var1  var2  var3
0     8    11    14
1    11    13    15
2    18    25     8

In [34]:
df.loc[0:3, "var3"]

0    14
1    15
2     8
3    11
Name: var3, dtype: int64

**Eger ayni yontemi iloc ile kullanmak istersek bu yolu izleyebiliriz.**

In [36]:
df.iloc[0:3]["var3"]

0    14
1    15
2     8
Name: var3, dtype: int64

In [37]:
df.iloc[0:3,2]

0    14
1    15
2     8
Name: var3, dtype: int64

## Koşullu Eleman İşlemleri

Koşullar index elemanları gibi köşeli parantez içine yazılırlar.

In [38]:
df[df.var1 > 15]

   var1  var2  var3
2    18    25     8
5    29     9     4
7    27    11     3
9    23    28    16

In [39]:
df[df.var1 > 15]["var1"]

2    18
5    29
7    27
9    23
Name: var1, dtype: int64

Belirli sütünları böyle alabileceğimiz gibi loc ile de alabiliriz.

In [40]:
df[df.var1 > 15][["var1","var2"]]

   var1  var2
2    18    25
5    29     9
7    27    11
9    23    28

In [41]:
df.loc[df.var1 > 15, ["var1","var2"]]

   var1  var2
2    18    25
5    29     9
7    27    11
9    23    28

## Join İşlemleri

Birden fazla DF'i birleştirmek istiyorsak bunun için pandas içerisindeki **concat** metodunu kullanırız.

In [42]:
x1 = np.random.randint(1,30,size = (5,3))
x2 = np.random.randint(1,30,size = (5,3))

df1 = pd.DataFrame(x1, columns=["var1","var2","var3"])
df2 = pd.DataFrame(x2, columns=["var1","var2","var3"])

pd.concat([df1,df2])

   var1  var2  var3
0    28     8    11
1    29    12    15
2    23     4    10
3    28    15    16
4    23     5    10
0    13    21     6
1    20    15    14
2     1    22    22
3    17     5     1
4    22    17    25

Goruldugu uzere indexlerin siralanmasinda bir problem ortaya cikti.
Bunu cozmek icin **ignore_index** attribute degerini True yapmamiz gerekiyor.

In [43]:
pd.concat([df1,df2], ignore_index=True)

   var1  var2  var3
0    28     8    11
1    29    12    15
2    23     4    10
3    28    15    16
4    23     5    10
5    13    21     6
6    20    15    14
7     1    22    22
8    17     5     1
9    22    17    25

In [44]:
df3 = pd.DataFrame(x1, columns=["var1","var2","deger3"])
df4 = pd.DataFrame(x2, columns=["var1","var2","var3"])

pd.concat([df3,df4])

   var1  var2  deger3  var3
0    28     8    11.0   NaN
1    29    12    15.0   NaN
2    23     4    10.0   NaN
3    28    15    16.0   NaN
4    23     5    10.0   NaN
0    13    21     NaN   6.0
1    20    15     NaN  14.0
2     1    22     NaN  22.0
3    17     5     NaN   1.0
4    22    17     NaN  25.0

Column degerleri farkli olan DataFrameleri birlestirmek istedigimizde karsilikli farkli olan columnlarin NaN ile dolduruldugu gorulur.

Eger sadece kesisimleri birlestirmek istersek **join** attribute degerini __inner__ yapmamiz gerekir.

In [45]:
pd.concat([df3,df4],join="inner")

   var1  var2
0    28     8
1    29    12
2    23     4
3    28    15
4    23     5
0    13    21
1    20    15
2     1    22
3    17     5
4    22    17

* one to one
* many to one
* many to many gibi islemler **merge** fonksiyonu ile gerceklestirilir. Merge fonksiyonuna hangi ortak column secilecegini soylemek istersek **on** attribute icerisine string olarak verilebilir.

## Aggregation & Grouping

- Basic aggregation functions
    * count()
    * first()
    * last()
    * mean()
    * median()
    * min()
    * max()
    * std()
    * var()
    * sum()

In [46]:
import seaborn as sns

In [47]:
df = sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [48]:
df.shape

(1035, 6)

In [49]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [50]:
df.mean()["number"]

1.7855072463768116

In [51]:
df["number"].mean()

1.7855072463768116

Eger verisetinin hesaplanmis tum degerlerini gormek istedigimizde **describe** ozelligini kullaniyoruz.

In [52]:
df.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

describe degerinin transposeunu almak istersek sonuna .T ekleyerek gerceklestirebiliriz.

In [53]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

Eger df icerisindeki bos degeri bu hesaplamaya katmak istemiyorsak **dropna** metodunu kullanabiliriz.

In [54]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

## Grouping

* Gruplama islemi, Aggeregation ile birlikte kullanilir.
* Veri seti icerisindeki kategorik degiskene gore gruplama yapilir.
* Kategorik degiskene gore gruplama yapildiktan sonra ise kalan degiskenlerden bir tanesi secilerek onun uzerinde aggregation yapilarak gerekli sonuclar elde edilir.

In [55]:
df.groupby("method")

Goruldugu uzere planets veri seti uzerinde kategorik degisken olan method degiskeni uzerinde bir gruplama yaptigimizda herhangi bir sonuc alamayiz.

In [56]:
df.groupby("method")["distance"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,17.875000,4.094148,14.98,16.4275,17.875,19.3225,20.77
Eclipse Timing Variations,4.0,315.360000,213.203907,130.72,130.7200,315.360,500.0000,500.00
Imaging,32.0,67.715937,53.736817,7.69,22.1450,40.395,132.6975,165.00
Microlensing,10.0,4144.000000,2076.611556,1760.00,2627.5000,3840.000,4747.5000,7720.00
Orbital Brightness Modulation,2.0,1180.000000,0.000000,1180.00,1180.0000,1180.000,1180.0000,1180.00
Pulsar Timing,1.0,1200.000000,NaN,1200.00,1200.0000,1200.000,1200.0000,1200.00
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,530.0,51.600208,45.559381,1.35,24.4125,40.445,59.2175,354.00
Transit,224.0,599.298080,913.876990,38.00,200.0000,341.000,650.0000,8500.00
Transit Timing Variations,3.0,1104.333333,915.819487,339.00,597.0000,855.000,1487.0000,2119.00

Gruplama yaptiktan sonra hangi degisken uzerinde islem yapacagimizi belirtip aggregation islemimizi gerceklestiriyoruz.

## Aggregate Function

Aggregate metodunda kullanilacak olan aggregation metotlarini biz belirleriz.

In [57]:
df.groupby("method").aggregate(["min",np.median,"max"])

                              number            orbital_period                \
                                 min median max            min        median
method
Astrometry                         1      1   1     246.360000    631.180000
Eclipse Timing Variations          1      2   2    1916.250000   4343.500000
Imaging                            1      1   4    4639.150000  27500.000000
Microlensing                       1      1   2    1825.000000   3300.000000
Orbital Brightness Modulation      1      2   2       0.240104      0.342887
Pulsar Timing                      1      3   3       0.090706     66.541900
Pulsation Timing Variations        1      1   1    1170.000000   1170.000000
Radial Velocity                    1      1   6       0.736540    360.200000
Transit                            1      1   7       0.355000      5.714932
Transit Timing Variations          2      2   3      22.339500     57.011000

                                                mass               distance  \
                                         max     min median    max      min
method
Astrometry                       1016.000000     NaN    NaN    NaN    14.98
Eclipse Timing Variations       10220.000000  4.2000  5.125   6.05   130.72
Imaging                        730000.000000     NaN    NaN    NaN     7.69
Microlensing                     5100.000000     NaN    NaN    NaN  1760.00
Orbital Brightness Modulation       1.544929     NaN    NaN    NaN  1180.00
Pulsar Timing                   36525.000000     NaN    NaN    NaN  1200.00
Pulsation Timing Variations      1170.000000     NaN    NaN    NaN      NaN
Radial Velocity                 17337.500000  0.0036  1.260  25.00     1.35
Transit                           331.600590  1.4700  1.470   1.47    38.00
Transit Timing Variations         160.000000     NaN    NaN    NaN   339.00

                                                  year
                                 median      max   min  median   max
method
Astrometry                       17.875    20.77  2010  2011.5  2013
Eclipse Timing Variations       315.360   500.00  2008  2010.0  2012
Imaging                          40.395   165.00  2004  2009.0  2013
Microlensing                   3840.000  7720.00  2004  2010.0  2013
Orbital Brightness Modulation  1180.000  1180.00  2011  2011.0  2013
Pulsar Timing                  1200.000  1200.00  1992  1994.0  2011
Pulsation Timing Variations         NaN      NaN  2007  2007.0  2007
Radial Velocity                  40.445   354.00  1989  2009.0  2014
Transit                         341.000  8500.00  2002  2012.0  2014
Transit Timing Variations       855.000  2119.00  2011  2012.5  2014

Boylece her bir degisken icin ayri ayri aggreagtion metotlarini uygulayabiliriz.

Burada aggregate metodu icerisine liste seklinde aggregation yontemlerini veriyoruz. Pandas icerisindeki metotlari verirken hem string hem de normal olarak verebiliriz. String olarak vermek farkindalik acisindan kolaylik saglar.

In [58]:
df.groupby("method").aggregate({"number" : "min", "distance" : "max"})

                               number  distance
method
Astrometry                          1     20.77
Eclipse Timing Variations           1    500.00
Imaging                             1    165.00
Microlensing                        1   7720.00
Orbital Brightness Modulation       1   1180.00
Pulsar Timing                       1   1200.00
Pulsation Timing Variations         1       NaN
Radial Velocity                     1    354.00
Transit                             1   8500.00
Transit Timing Variations           2   2119.00

Bu sekildeki kullanimda ise her bir attribute icin farkli bir aggr. yontemi belirleyebiliriz.

## Filter Function

Filter fonksiyonu kendi tanimladigimiz bir fonksiyon ile belirli sorgulari yapmayi ve ona gore veri setinden filtreleme yapip sonuclari almayi saglayan bir metottur.

In [59]:
df = pd.DataFrame({"groups" : ['A', 'B', 'C' , 'A', 'B', 'C'],
                   "degisken1" : [1 , 22 ,3 , 44 , 5 , 66],
                   "degisken2" : [111,22,333,44,555,66]})
df

  groups  degisken1  degisken2
0      A          1        111
1      B         22         22
2      C          3        333
3      A         44         44
4      B          5        555
5      C         66         66

In [60]:
def filter_func(x):
    return x["degisken1"].std() > 25

In [61]:
df.groupby("groups").filter(filter_func)

  groups  degisken1  degisken2
0      A          1        111
2      C          3        333
3      A         44         44
5      C         66         66

## Transform Function

* Transform fonksiyonu vektorel calisan bir fonksiyondur.
* Kendi tanimladigimiz fonksiyonu, degiskenlerin degerlerine uygular. Yani sutun bazli calisir.
* Sayisal bir ifade gerceklestirilecekse, kategorik degiskenlerden kurtulmak gerekir.

In [62]:
df.iloc[:,1:3].transform(lambda x: x-x.mean())

   degisken1  degisken2
0      -22.5      -77.5
1       -1.5     -166.5
2      -20.5      144.5
3       20.5     -144.5
4      -18.5      366.5
5       42.5     -122.5

## Apply Function

* Transfrom ve Filter fonksiyonu gibi DataFrame'in degiskenleri uzerinde gezinme yetenigi olan ve Aggregation amaciyla kullanilabilecek olan bir fonksiyondur.

In [63]:
df.apply(np.sum)

groups       ABCABC
degisken1       141
degisken2      1131
dtype: object

# Pivot Tables

* Pivot tablolar, veri seti uzerinde bazi satir ve sutunsal islemler gerceklestirerek veri setini amaca uygun hale getirmek icin kullanilan yapilardir.
* Groupby ile karistirilmaktadir. Groupby'in cok boyutlu bir versiyonu olarak dusunulmelidir.

In [64]:
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

Ilkel pivot islemini su sekilde gerceklestirebiliriz.

In [65]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [66]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

_unstack_ fonksiyonu ise tablo bir duzey indirilmis sekilde listelenir.

In [67]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

Pivot Table ise DataFrame methodu olarak kullanilmaktadir. Ilk parametre odaklandigimiz degisken, index x ekseninde var olacak degerleri iceren degisken, columns ise de y ekseninde var olacak degerleri iceren degiskendir.

In [68]:
titanic.pivot_table("survived", index="sex", columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

Surekli bir veri setini kategorik bir veri setine cevirerek pivot table islemi gerceklestirelim.

In [69]:
titanic.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [70]:
age = pd.cut(titanic.age,[0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [71]:
titanic.pivot_table("survived",index=["sex",age],columns="class")

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663